wpchom/drv_chip_gd32h7xx/GD32H77x_Firmware_Library_V0.2.0/Firmware/GD32H77x_standard_peripheral/Include/gd32h77x_trigsel.h
/* target peripheral definitions */
typedef enum
{
    TRIGSEL_OUTPUT_TRIGSEL_OUT0           = ((uint8_t)0x00U),               /*!< output target peripheral TRIGSEL_OUT0 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT1           = ((uint8_t)0x01U),               /*!< output target peripheral TRIGSEL_OUT1 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT2           = ((uint8_t)0x04U),               /*!< output target peripheral TRIGSEL_OUT2 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT3           = ((uint8_t)0x05U),               /*!< output target peripheral TRIGSEL_OUT3 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT4           = ((uint8_t)0x08U),               /*!< output target peripheral TRIGSEL_OUT4 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT5           = ((uint8_t)0x09U),               /*!< output target peripheral TRIGSEL_OUT5 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT6           = ((uint8_t)0x0CU),               /*!< output target peripheral TRIGSEL_OUT6 pin */
    TRIGSEL_OUTPUT_TRIGSEL_OUT7           = ((uint8_t)0x0DU),               /*!< output target peripheral TRIGSEL_OUT7 pin */
    TRIGSEL_OUTPUT_ADC0_REGTRG            = ((uint8_t)0x10U),               /*!< output target peripheral ADC0_REGTRG */
    TRIGSEL_OUTPUT_ADC0_INSTRG            = ((uint8_t)0x11U),               /*!< output target peripheral ADC0_INSTRG */
    TRIGSEL_OUTPUT_ADC1_REGTRG            = ((uint8_t)0x14U),               /*!< output target peripheral ADC1_REGTRG */
    TRIGSEL_OUTPUT_ADC1_INSTRG            = ((uint8_t)0x15U),               /*!< output target peripheral ADC1_INSTRG */
    TRIGSEL_OUTPUT_ADC2_REGTRG            = ((uint8_t)0x18U),               /*!< output target peripheral ADC2_REGTRG */
    TRIGSEL_OUTPUT_ADC2_INSTRG            = ((uint8_t)0x19U),               /*!< output target peripheral ADC2_INSTRG */
    TRIGSEL_OUTPUT_DAC0_OUT0_EXTRG        = ((uint8_t)0x1CU),               /*!< output target peripheral DAC0_OUT0_EXTRG */
    TRIGSEL_OUTPUT_DAC0_OUT1_EXTRG        = ((uint8_t)0x20U),               /*!< output target peripheral DAC0_OUT1_EXTRG */
    TRIGSEL_OUTPUT_TIMER0_BRKIN0          = ((uint8_t)0x24U),               /*!< output target peripheral TIMER0_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER0_BRKIN1          = ((uint8_t)0x25U),               /*!< output target peripheral TIMER0_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER0_BRKIN2          = ((uint8_t)0x26U),               /*!< output target peripheral TIMER0_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN0          = ((uint8_t)0x28U),               /*!< output target peripheral TIMER7_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN1          = ((uint8_t)0x29U),               /*!< output target peripheral TIMER7_BRKIN1 */
    TRIGSEL_OUTPUT_TIMER7_BRKIN2          = ((uint8_t)0x2AU),               /*!< output target peripheral TIMER7_BRKIN2 */
    TRIGSEL_OUTPUT_TIMER14_BRKIN0         = ((uint8_t)0x2CU),               /*!< output target peripheral TIMER14_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER15_BRKIN0         = ((uint8_t)0x30U),               /*!< output target peripheral TIMER15_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER16_BRKIN0         = ((uint8_t)0x34U),               /*!< output target peripheral TIMER16_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER40_BRKIN0         = ((uint8_t)0x38U),               /*!< output target peripheral TIMER40_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER41_BRKIN0         = ((uint8_t)0x3CU),               /*!< output target peripheral TIMER41_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER42_BRKIN0         = ((uint8_t)0x40U),               /*!< output target peripheral TIMER42_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER43_BRKIN0         = ((uint8_t)0x44U),               /*!< output target peripheral TIMER43_BRKIN0 */
    TRIGSEL_OUTPUT_TIMER44_BRKIN0         = ((uint8_t)0x48U),               /*!< output target peripheral TIMER44_BRKIN0 */
    TRIGSEL_OUTPUT_CAN0_EX_TIME_TICK      = ((uint8_t)0x4CU),               /*!< output target peripheral CAN0_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN1_EX_TIME_TICK      = ((uint8_t)0x50U),               /*!< output target peripheral CAN1_EX_TIME_TICK */
    TRIGSEL_OUTPUT_CAN2_EX_TIME_TICK      = ((uint8_t)0x54U),               /*!< output target peripheral CAN2_EX_TIME_TICK */
    TRIGSEL_OUTPUT_LPDTS_TRG              = ((uint8_t)0x58U),               /*!< output target peripheral LPDTS_TRG */
    TRIGSEL_OUTPUT_TIMER0_ETI             = ((uint8_t)0x5CU),               /*!< output target peripheral TIMER0_ETI */
    TRIGSEL_OUTPUT_TIMER1_ETI             = ((uint8_t)0x60U),               /*!< output target peripheral TIMER1_ETI */
    TRIGSEL_OUTPUT_TIMER2_ETI             = ((uint8_t)0x64U),               /*!< output target peripheral TIMER2_ETI */
    TRIGSEL_OUTPUT_TIMER3_ETI             = ((uint8_t)0x68U),               /*!< output target peripheral TIMER3_ETI */
    TRIGSEL_OUTPUT_TIMER4_ETI             = ((uint8_t)0x6CU),               /*!< output target peripheral TIMER4_ETI */
    TRIGSEL_OUTPUT_TIMER7_ETI             = ((uint8_t)0x70U),               /*!< output target peripheral TIMER7_ETI */
    TRIGSEL_OUTPUT_TIMER22_ETI            = ((uint8_t)0x74U),               /*!< output target peripheral TIMER22_ETI */
    TRIGSEL_OUTPUT_TIMER23_ETI            = ((uint8_t)0x78U),               /*!< output target peripheral TIMER23_ETI */
    TRIGSEL_OUTPUT_TIMER30_ETI            = ((uint8_t)0x7CU),               /*!< output target peripheral TIMER30_ETI */
    TRIGSEL_OUTPUT_TIMER31_ETI            = ((uint8_t)0x80U),               /*!< output target peripheral TIMER31_ETI */
    TRIGSEL_OUTPUT_EDOUT_TRG              = ((uint8_t)0x84U),               /*!< output target peripheral EDOUT_TRG */
    TRIGSEL_OUTPUT_HPDF_ITR               = ((uint8_t)0x88U),               /*!< output target peripheral HPDF_ITR */
    TRIGSEL_OUTPUT_TIMER0_ITI14           = ((uint8_t)0x8CU),               /*!< output target peripheral TIMER0_ITI14 */
    TRIGSEL_OUTPUT_TIMER1_ITI14           = ((uint8_t)0x90U),               /*!< output target peripheral TIMER1_ITI14 */
    TRIGSEL_OUTPUT_TIMER2_ITI14           = ((uint8_t)0x94U),               /*!< output target peripheral TIMER2_ITI14 */
    TRIGSEL_OUTPUT_TIMER3_ITI14           = ((uint8_t)0x98U),               /*!< output target peripheral TIMER3_ITI14 */
    TRIGSEL_OUTPUT_TIMER4_ITI14           = ((uint8_t)0x9CU),               /*!< output target peripheral TIMER4_ITI14 */
    TRIGSEL_OUTPUT_TIMER7_ITI14           = ((uint8_t)0xA0U),               /*!< output target peripheral TIMER7_ITI14 */
    TRIGSEL_OUTPUT_TIMER14_ITI14          = ((uint8_t)0xA4U),               /*!< output target peripheral TIMER14_ITI14 */
    TRIGSEL_OUTPUT_TIMER22_ITI14          = ((uint8_t)0xA8U),               /*!< output target peripheral TIMER22_ITI14 */
    TRIGSEL_OUTPUT_TIMER23_ITI14          = ((uint8_t)0xACU),               /*!< output target peripheral TIMER23_ITI14 */
    TRIGSEL_OUTPUT_TIMER30_ITI14          = ((uint8_t)0xB0U),               /*!< output target peripheral TIMER30_ITI14 */
    TRIGSEL_OUTPUT_TIMER31_ITI14          = ((uint8_t)0xB4U),               /*!< output target peripheral TIMER31_ITI14 */
    TRIGSEL_OUTPUT_TIMER40_ITI14          = ((uint8_t)0xB8U),               /*!< output target peripheral TIMER40_ITI14 */
    TRIGSEL_OUTPUT_TIMER41_ITI14          = ((uint8_t)0xBCU),               /*!< output target peripheral TIMER41_ITI14 */
    TRIGSEL_OUTPUT_TIMER42_ITI14          = ((uint8_t)0xC0U),               /*!< output target peripheral TIMER42_ITI14 */
    TRIGSEL_OUTPUT_TIMER43_ITI14          = ((uint8_t)0xC4U),               /*!< output target peripheral TIMER43_ITI14 */
    TRIGSEL_OUTPUT_TIMER44_ITI14          = ((uint8_t)0xC8U),               /*!< output target peripheral TIMER44_ITI14 */
    TRIGSEL_OUTPUT_RDCM_NCO               = ((uint8_t)0xD4U),               /*!< output target peripheral RDCM_NCO */
    TRIGSEL_OUTPUT_RDCM_TS                = ((uint8_t)0xD5U),               /*!< output target peripheral RDCM_TS */
    TRIGSEL_OUTPUT_RDCM_MAINCAL           = ((uint8_t)0xD6U),               /*!< output target peripheral RDCM_MAINCAL */
    TRIGSEL_OUTPUT_TIMER0_CH0BRKIN        = ((uint8_t)0xD8U),               /*!< output target peripheral TIMER0_CH0BRKIN */
    TRIGSEL_OUTPUT_TIMER0_CH1BRKIN        = ((uint8_t)0xD9U),               /*!< output target peripheral TIMER0_CH1BRKIN */
    TRIGSEL_OUTPUT_TIMER0_CH2BRKIN        = ((uint8_t)0xDCU),               /*!< output target peripheral TIMER0_CH2BRKIN */
    TRIGSEL_OUTPUT_TIMER0_CH3BRKIN        = ((uint8_t)0xDDU),               /*!< output target peripheral TIMER0_CH3BRKIN */
    TRIGSEL_OUTPUT_TIMER7_CH0BRKIN        = ((uint8_t)0xE0U),               /*!< output target peripheral TIMER7_CH0BRKIN */
    TRIGSEL_OUTPUT_TIMER7_CH1BRKIN        = ((uint8_t)0xE1U),               /*!< output target peripheral TIMER7_CH1BRKIN */
    TRIGSEL_OUTPUT_TIMER7_CH2BRKIN        = ((uint8_t)0xE4U),               /*!< output target peripheral TIMER7_CH2BRKIN */
    TRIGSEL_OUTPUT_TIMER7_CH3BRKIN        = ((uint8_t)0xE5U),               /*!< output target peripheral TIMER7_CH3BRKIN */
    TRIGSEL_OUTPUT_ENDAT                  = ((uint8_t)0xE8U),               /*!< output target peripheral ENDAT */
    TRIGSEL_OUTPUT_AFMT                   = ((uint8_t)0xECU),               /*!< output target peripheral AFMT */
    TRIGSEL_OUTPUT_TFMT                   = ((uint8_t)0xF0U),               /*!< output target peripheral TFMT */
    TRIGSEL_OUTPUT_BISS                   = ((uint8_t)0xF4U),               /*!< output target peripheral BISS */
    TRIGSEL_OUTPUT_HDSL                   = ((uint8_t)0xF8U)                /*!< output target peripheral HDSL */
}trigsel_periph_enum;

/* function declarations */
/* deinitialize TRIGSEL */
void trigsel_deinit(void);
/* set the trigger input signal for target peripheral */
void trigsel_init(trigsel_periph_enum target_periph, trigsel_source_enum trigger_source);
/* get the trigger input signal for target peripheral */
trigsel_source_enum trigsel_trigger_source_get(trigsel_periph_enum target_periph);
/* lock the trigger register */
void trigsel_register_lock_set(trigsel_periph_enum target_periph);
/* get the trigger register lock status */
FlagStatus trigsel_register_lock_get(trigsel_periph_enum target_periph);

#endif /* GD32H77X_TRIGSEL_H */
